 import React, { Component } from 'react';
 
class Definition extends Component
 {
  render (){
    return(

  <div class="container main" >
   
       <div class="row " >
    <div class="col ">
    <br/>
    <h1>  Визначення</h1>
    <text><strong>Шо́рсткість пове́рхні</strong> — характеристика нерівностей, виражена у числових величинах, що визначають ступінь їхнього відхилення на базовій довжині від теоретично гладких поверхонь заданої геометричної форми</text>
    <br/>  <br/>
    <text>Шорсткість поверхні  — важливий показник у технічній характеристиці виробу та точності його виготовлення, що впливає на експлуатаційні властивості деталей і вузлів машин — стійкість до зносу поверхонь тертя, витривалість, корозійну стійкість, збереження натягу у пресових з'єднаннях тощо.</text>
    <br/>
    <text>Шорсткість поверхні визначають по її профілю, який утворюється в перетині цієї поверхні площиною, перпендикулярною до номінальної поверхні. При цьому профіль розглядається на довжині базової лінії, відносно якої визначаються і оцінюються параметри шорсткості поверхні. При стандартизації шорсткості поверхонь в основу прийнята система "М", в якій в якості базової лінії служить середня лінія профілю, тобто лінія, що має форму номінального профілю і проведена так, що в межах базової довжини середнє квадратичне відхилення профілю від цієї лінії мінімальне.</text>
    </div>
  </div>

  </div>

     )
 }
}

export default Definition;
