 import React, { Component } from 'react';
 
 
class Ghost extends Component
 {
  render (){
    return(

  <div class="container main" >
   
       <div class="row " >
       <div class="col-xl-8 col-md-6 col-12">
        <br/>
    <h1>Умовне позначення шорсткості за ГОСТ2.309-73 (ISO 1302)</h1>
    <p>Шорсткість поверхонь на креслениках деталі вказують для усіх поверхонь, що виконуються за цим креслеником, незалежно від методів їх утворення, крім поверхонь, шорсткість котрих не обумовлена вимогами конструкції. Структура позначення шорсткості поверхні наведена на рисунку.
    <br/><br/>
Вид обробки поверхні вказують у позначенні шорсткості тільки у випадках, коли він є єдиним, для отримання потрібної якості поверхні.
<br/><br/>
У випадку, коли структуру (напрямок шорсткості) і спосіб обробки поверхні не вказують, знак шорсткості зображують без полиці.
<br/><br/>
Крім того, якщо знак шорсткості поміщають в правому верхньому куті кресленика (він відноситься до усіх поверхонь деталі), а якщо за ним у дужках вказано символ шорсткості, то цей параметр відноситься до решти поверхонь, шорсткість яких не вказана безпосередньо.
<br/><br/>
Значення параметрів шорсткості вказують на кресленнях за такими правилами (див. рис.):</p>
<ul><
  li><i>Ra</i> вказується без символу, а інші параметри із символом;</li>
<li>при вказанні діапазону параметрів записують межі у два рядки;</li>
<li>при вказанні декількох параметрів шорсткості їх значення записують у стовпець, зверху вниз у такому порядку: <i>Ra, Rz, Rmax, Sm, S, tp</i>;</li>
<li>якщо шорсткість нормується параметром <i>Ra</i> чи <i>Rz</i> з числа наведених вище у таблиці, то базову довжину в позначенні шорсткості не вказують.</li></ul>
 <p>Умовні позначення структури поверхні наведені на наступному рисунку. Умовні позначення напрямку нерівностей вказують на кресленику при необхідності.
 <br/><br/>
Позначення шорсткості поверхонь на зображенні виробу розміщають на лініях контуру, виносних лініях (по можливості ближче до розмірної лінії) або на полицях ліній-виносок.
<br/><br/>
Допускається при недостачі місця розміщати позначення шорсткості на розмірних лініях або на їх продовженні, а також розривати виносну лінію.</p>
  </div>
  <div class="col-xl-4 col-md-6 col-12">
  <br/>
  <div class="card">
  <img src="img/1.gif"class="card-img-top" alt="..."/>
  <div class="card-body">
    <text class="card-title">Структура умовного позначення шорсткості на креслениках</text>
  </div>
 
</div>
<br/>
<div class="card">
  <img src="img/2.jpg"class="card-img-top" alt="..."/>
  <div class="card-body">
    <text class="card-title">Умовні позначення виду структури поверхні</text>
  </div>
 
</div>
<br/>
<div class="card">
  <img src="img/3.png"class="card-img-top" alt="..."/>
  <div class="card-body">
    <text class="card-title">Нормальний профіль та параметри шорсткості</text>
  </div>
 
</div>

  </div>
  </div>
  </div>

     )
 }
}

export default Ghost;
