 import React, { Component } from 'react';
 
 
class Parameters extends Component
 {
  render (){
    return(

  <div class="container main" >
   
       <div class="row " >
    <div class="col ">
      <br/>
      <h1>Параметри шорсткості</h1>
      <div class="card col-xl-5 col-sm-4 col-md-5 col-12 im1">
  <img src="/img/Roughness_uk.gif" class="card-img-top" alt="..."/>
  <div class="card-body">
    <text class="card-title">Нормальний профіль та параметри шорсткості</text>
  </div>
  
  </div>
      <text class="text1">Шорсткість відноситься до мікрогеометрії твердого тіла і визначає його найважливіші експлуатаційні властивості. Перш за все зносостійкість від стирання, міцність, щільність (герметичність) з'єднань, хімічна стійкість, зовнішній вигляд. Залежно від умов роботи поверхні призначається параметр шорсткості при проектуванні деталей машин. Державним стандартом ДСТУ ISO 4287:2012 визначено номенклатуру з 6-ти параметрів оцінки шорсткості поверхні, з яких для характеристики шорсткості вибирається один або декілька. Ці параметри такі </text>
      <p> Висотні:</p>
 
      <ul class="text1">
        <li><i>Ra</i> — середнє арифметичне абсолютних значень відхилень профілю в межах базової довжини);</li>
        <li><i>Rz</i>  — висота нерівностей профілю по 10 точках (сума середніх абсолютних значень висот п'яти найбільших виступів і глибин п'яти найбільших впадин профілю в межах базової довжини);</li>
        <li><i>Rmax</i>   — найбільша висота профілю (відстань між лінією виступів профілю і лінією впадин профілю в межах базової довжини).</li></ul>
      <p>Крокові:</p>
  
      <ul class="text1">
        <li><i>S</i> — середній крок місцевих виступів профілю (середнє арифметичне значення кроку нерівностей профілю по вершинах в межах базової довжини);</li>
        <li><i>Sm</i> — середній крок нерівностей профілю по середній лінії (середнє арифметичне значення кроку нерівностей профілю в межах базової довжини).</li></ul>
      <p>Висотно-кроковий:</p>
      <ul class="text1">
        <li><i>tp</i> — відносна опорна довжина профілю (відношення опорної довжини профілю до базової довжини, де <i>p</i> — значення рівня перерізу профілю).</li></ul>
  <p class="text1">Виступи шорсткості розподіляються на поверхні стінок рівномірно або нерівномірно, причому в загальному випадку вони можуть мати різну форму й розміри. В трубах промислового сортаменту через технологічну недосконалість їх виготовлення шорсткість розподілена нерівномірно. У випадку штучної шорсткості, як, напр., у дослідах І.Нікурадзе, шорсткість рівномірна за висотою.</p>
  </div>
  </div>
  <h1>Вимоги до шорсткості в залежності від функції поверхні</h1>

  <table class="table-bordered tb1">
  <thead class="text1">
    <tr>
      <th scope="col">Елемент деталі	</th>
      <th scope="col">Параметр шорсткості</th>
    </tr>
  </thead>
  <tbody class="text1">
    <tr>
      <td>Неробочі контури деталей. Поверхні деталей, що встановлюються на бетонних, цегляних і дерев'яних основах.</td>
      <td>Rz 320…160</td>
    </tr>
    <tr>
      <td>Наскрізні отвори для кріпильних деталей. Виточки, проточки. Отвори масляних каналів на приводних валах. Кромки деталі під зварні шви. Опорні поверхні пружин стиснення. Монтажні площини станин, корпусів, лап.</td>
      <td>Rz 80</td>
    </tr>
    <tr>
      <td>Внутрішній діаметр шліцьових з'єднань (не шліфованих). Вільні (неспряжувані) торцеві поверхні вал, муфт, втулок. Поверхні головок болтів.</td>
      <td>Rz 40</td>
    </tr>
    <tr>
      <td>Торцеві поверхні під підшипники кочення. Поверхні втулок, кілець, маточин, що прилягають до інших поверхонь, але не є посадочними. Неробочі торці валів, втулок, планок. Шийки валів 12-го квалітету діаметром 80-500 мм. Поверхні отворів 12-го квалітету діаметром 18-500 мм і 11-го квалітету.</td>
      <td>Rz 20</td>
    </tr>
    <tr>
      <td>Неробочі торцеві поверхні зубчастих та черв'ячних коліс і зірочок. Рівці, фаски, виточки, зенковки, заокруглення тощо Болти і гайки нормальної і підвищеної точності (крім різі).</td>
      <td>Rz 10…40</td>
    </tr>
    <tr>
      <td>Кульові поверхні ніпельних з'єднань. Рівці під ущільнюючі гумові кільця для рухомих і нерухомих торцевих з'єднань. Радіуси закруглень на силових валах. Поверхні осей для ексцентриків. Опорні площини рейок. Поверхні виступаючих частин деталей, що швидко обертаються. Поверхні напрямних типу «ластівчин хвіст». Опорні площини рейок. Шийки валів 9-го квалітету діаметром 80—500 мм, 11-го квалітету діаметром 3—30 мм. Поверхні отворів 7-го квалітету діаметром 180–500 мм, 9-го квалітету діаметром 18—360 мм, 11-го квалітету діаметром 1—10 мм</td>
      <td>Ra 2,5</td>
    </tr>
    <tr>
      <td>Зовнішні діаметри шліцьового з'єднання. Отвори підгінних і регульованих з'єднань (вкладиші підшипників тощо) з допуском зазору — натягу 25-40 мкм. Гідроциліндри, що працюють з гумовими манжетами. Отвори підшипників ковзання. Тертьові поверхні малонавантажених деталей. Робочі поверхні дисків тертя. Шийки валів 6-го квалітету діаметром 120–500 мм, 8-го квалітету діаметром 6-80 мм. Поверхні отворів 6-го квалітету діаметром 50-500 мм, 7-го квалітету діаметром 10-180 мм, 9-го квалітету — 1-18 мм</td>
      <td>Ra 1,25</td>
    </tr>
    <tr>
      <td>Поверхні дзеркал циліндрів, які працюють з гумовими манжетами. Торцеві поверхні поршневих кілець при діаметрі не менше 240 мм. Вали що підганяються і регульованих з'єднаннях з допуском зазору — натягу 7-25 мкм. Тертьові поверхні навантажених деталей. Посадочні поверхні 7-го квалітету з тривалим збереженням заданої посадки: осі ексцентриків, точні черв'яки, зубчасті колеса. Спряжені поверхні бронзових зубчастих коліс. Робочі шийки розподільних валів. Штоки і шийки валів в ущільненнях. Шийки валів 5-го квалітету діаметром 30-500 мм, 6-го квалітету діаметром 10-120 мм. Поверхні отворів 6-го квалітету
діаметром 3-50 мм, 6-го квалітету діаметром 1-10 мм</td>
      <td>Ra 0,63</td>
    </tr>
    <tr>
      <td>Шийки валів 5-го квалітету діаметром понад 1 до 30 мм, 6-го квалітету діаметром понад 1 до 10 мм. Вали в "регульованих з'єднаннях (шийки шпинделів, золотники) з допусками зазору — натягу 16-25 мкм. Отвори регульованих з'єднань (вкладиші підшипників) з допуском зазору — натягу 4-7 мкм. Тертьові елементи навантажених деталей. Гідроциліндри, що працюють з поршневими кільцями</td>
      <td>Ra 0,32</td>
    </tr>
    <tr>
      <td>Поверхні деталей, що працюють на тертя, від зносу яких залежить точність роботи механізму</td>
      <td>Ra 0,160</td>
    </tr>
    <tr>
      <td>Робочі шийки валів прецизійних швидкохідних верстатів і механізмів. Шийки валів що підганяються і регульованих з'єднаннях з допуском зазору — натягу 2,5-6,5 мкм. Поверхні отворів що підганяються і регульованих з'єднань з допуском зазору — натягу до 2,5 мкм</td>
      <td>Ra 0,080</td>
    </tr>
    <tr>
      <td>Дзеркальні валики координатно-розточувальних верстатів та ін.</td>
      <td>Ra 0,040</td>
    </tr>
  </tbody>
</table>



  
  </div>

     )
 }
}

export default Parameters;
